{
    "versions": [
        {
            "version": 6.9,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added three new items to the side bar (Favorite Count, App Version, Download Count)\n-made peek and pop work on more than just one part. You can press and hold the text now to get it\n-added past version notes\n-added header to side bar so you guys know what FUN stands for and so you always know what version of the app you are on\n-fixed a small bug with viewing some shows"
        },
        {
            "version": 6.8,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-new peek and pop like action when wanting to preview a show\n-ALL NOTIFICATIONS SHOULD WORK NOW! (I hope. Send feedback if one isn't working)\n-added favorite count\n-added side drawer\n-added export and import finishing toast\n-changed star to checkbox to decide which shows you want to be shown on the homescreen"
        },
        {
            "version": 6.7,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-bug fixes\n-added a cheat like mode to video poker\n-added more high score stuff to solitaire\n-added something new to download a video (It is an option that can be turned on and off in the settings)\n"
        },
        {
            "version": 6.6,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-bug fixes\n-added a dialog to schedule so we can actually see the entire description\n-cleaning up schedule\n-fixed checking episode when show is not favorited bug\n-high score to solitaire (I dont care what you guys say. I play solitaire!)\n-added a new delete dialog (let me know if you guys like it)\n-made some things cleaner and smoother when going from activity to activity\n-new fancy effects when going to a new activity"
        },
        {
            "version": 6.5,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-bug fixes (I mean...We all saw this one coming)\n-changed hearts to stars\n-fixed some favoriting issues\n-made a better schedule reader\n-fixed app not downloading all parts to a movie"
        },
        {
            "version": 6.4,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-fixed a weird scrolling issue in schedule\n-added going back to home screen when going to show from a link\n-made share better, able to choose more options\n-made firebase notifications bigger so you guys can see more if there's an urgent message or if you want to see what was updated\n-made it so that when you go to downloads from notification and press back, it'll take you to the home screen\n-made it so that there is only one task (If you don't understand that's fine. Basically, bug fix)\n-bug fixes (Duh)\n-added feedback area so all of you guys can give me feedback! Even suggesting your own future features!"
        },
        {
            "version": 6.3,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added a time for when anime came out. It is not working for when they will come out, only once they come out. (Source is Livechart.me)\n-added import and export for favorites!\n-added sharing"
        },
        {
            "version": 6.2,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added customizable shows to display on the home screen\n-added settings to display a number of random favorites on home screen\n-fixed watched episode list being so wonky\n-added index bar when looking at shows\n-added multi-delete from view downloads\n-modified home screen title text a bit"
        },
        {
            "version": 6.1,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added a list of all favorite shows\n-added 10 random favorites to the home screen\n-added batch downloads\n-bug fixes and code cleanup\n-completely using a new server now"
        }
    ]
}