{
    "versions": [
        {
            "version": 7.7,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-after 5000ms (5 seconds) of being paused, notification will be dismissed\n-grouping more notifications (finished and currently downloading)\n-fixed delete video bug\n-fixed favorites checkign being weird\n-fixed peek and pop not working for favorites\n-hopefully fixed episode watch list from being stupid"
        },
        {
            "version": 7.6,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added awesome animation called shared elements\n-removed transition animation from episode activity\n-fixed solitaire win animation not doing it correctly\n-fixed show check service being all weird\n-fixed little bug when favoriting a show and returning to the list and the star isn't starred\n-added notification for when app is checking for updates\n-made badge go away when in recent and not when clicking the recent on app home screen\n-added a notification to show when show check finishes\n-added checks if device is offline\n-added next time for update checking\n-update checkes will start either on the hour or on the half hour\n-added setting to turn notifications on or off\n-added a quick tile for update checks\n-changed blackjack so that you can see all cards you and the dealer has\n-added some wifi settings\n"
        },
        {
            "version": 7.5,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-updated Fetch!\n-added time of videos that have been played\n-added swipe to cancel for view downloads\n-added play/pause indicator to widget and able to play and pause download on widget\n-added a clear notifications item to the side drawer\n-changed minimum widget size to 2x2\n-better notifications\n-(in 7.51) made a little mistake with notifications\n"
        },
        {
            "version": 7.4,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added fade out for lock dialog\n-fixed a bug for newcomers with shortcuts and no security\n-added widget so you can see current downloads on your homescreen!\n"
        },
        {
            "version": 7.3,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added a new shortcut to get to the videos\n-added double tap to play and pause video\n-changed some video colors\n-made video ui fade out\n-added picture in picture mode\n-added cartoon covers\n-removed solitaire shortcut and changed it to view downloads\n-added time save to video player (A.K.A. when you leave a video, your current position will be save for when you return)\n-added seek time, how much you are going forward or backwards in video player\n-lock button for video that will lock all controls until you press the button\n"
        },
        {
            "version": 7.2,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-made deleting videos nicer\n-added multi video delete\n-made video thumbnails the same size\n-modified some database interactivity\n-fixed refresh adding bug in episodes\n-added a refresh to the video viewer\n-fixed notificatoin update bug not showing the list\n-added a badge to view downloads option when something is done downloading\n-adding shortcuts\n-new video player. This one is MUCH better\n"
        },
        {
            "version": 7.1,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added delete from viewing the videos\n-added new activity to deal with opening videos from notification\n-modified delete dialog to work with files too\n-fixed text on video player buttons\n-made video viewer runtime text background black"
        },
        {
            "version": 7.0,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-HUGE code clean up and change. Changed how some things worked together for easier access on my side\n-added new option to manually check for show updates on home screen\n-modified how update checking works and is now MUCH more efficient\n-added video launcher!\n-added built in video player (You can still use your own if you would like. It is an option)\n"
        },
        {
            "version": 6.9,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added three new items to the side bar (Favorite Count, App Version, Download Count)\n-made peek and pop work on more than just one part. You can press and hold the text now to get it\n-added past version notes\n-added header to side bar so you guys know what FUN stands for and so you always know what version of the app you are on\n-fixed a small bug with viewing some shows"
        },
        {
            "version": 6.8,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-new peek and pop like action when wanting to preview a show\n-ALL NOTIFICATIONS SHOULD WORK NOW! (I hope. Send feedback if one isn't working)\n-added favorite count\n-added side drawer\n-added export and import finishing toast\n-changed star to checkbox to decide which shows you want to be shown on the homescreen"
        },
        {
            "version": 6.7,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-bug fixes\n-added a cheat like mode to video poker\n-added more high score stuff to solitaire\n-added something new to download a video (It is an option that can be turned on and off in the settings)\n"
        },
        {
            "version": 6.6,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-bug fixes\n-added a dialog to schedule so we can actually see the entire description\n-cleaning up schedule\n-fixed checking episode when show is not favorited bug\n-high score to solitaire (I dont care what you guys say. I play solitaire!)\n-added a new delete dialog (let me know if you guys like it)\n-made some things cleaner and smoother when going from activity to activity\n-new fancy effects when going to a new activity"
        },
        {
            "version": 6.5,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-bug fixes (I mean...We all saw this one coming)\n-changed hearts to stars\n-fixed some favoriting issues\n-made a better schedule reader\n-fixed app not downloading all parts to a movie"
        },
        {
            "version": 6.4,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-fixed a weird scrolling issue in schedule\n-added going back to home screen when going to show from a link\n-made share better, able to choose more options\n-made firebase notifications bigger so you guys can see more if there's an urgent message or if you want to see what was updated\n-made it so that when you go to downloads from notification and press back, it'll take you to the home screen\n-made it so that there is only one task (If you don't understand that's fine. Basically, bug fix)\n-bug fixes (Duh)\n-added feedback area so all of you guys can give me feedback! Even suggesting your own future features!"
        },
        {
            "version": 6.3,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added a time for when anime came out. It is not working for when they will come out, only once they come out. (Source is Livechart.me)\n-added import and export for favorites!\n-added sharing"
        },
        {
            "version": 6.2,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added customizable shows to display on the home screen\n-added settings to display a number of random favorites on home screen\n-fixed watched episode list being so wonky\n-added index bar when looking at shows\n-added multi-delete from view downloads\n-modified home screen title text a bit"
        },
        {
            "version": 6.1,
            "link": "https://github.com/jakepurple13/ForUsNerds/raw/master/app-debug.apk",
            "devNotes": "-added a list of all favorite shows\n-added 10 random favorites to the home screen\n-added batch downloads\n-bug fixes and code cleanup\n-completely using a new server now"
        }
    ]
}